package solution

import "fmt"

/**
给你一个下标从 1 开始的整数数组 numbers ，该数组已按 非递减顺序排列 ，请你从数组中找出满足相加之和等于目标数 target 的两个数。如果设这两个
数分别是 numbers[index1] 和 numbers[index2] ，则 1 <= index1 < index2 <= numbers.
length 。

 以长度为 2 的整数数组 [index1, index2] 的形式返回这两个整数的下标 index1 和 index2。

 你可以假设每个输入 只对应唯一的答案 ，而且你 不可以 重复使用相同的元素。

 你所设计的解决方案必须只使用常量级的额外空间。


 示例 1：


输入：numbers = [2,7,11,15], target = 9
输出：[1,2]
解释：2 与 7 之和等于目标数 9 。因此 index1 = 1, index2 = 2 。返回 [1, 2] 。

 示例 2：


输入：numbers = [2,3,4], target = 6
输出：[1,3]
解释：2 与 4 之和等于目标数 6 。因此 index1 = 1, index2 = 3 。返回 [1, 3] 。

 示例 3：


输入：numbers = [-1,0], target = -1
输出：[1,2]
解释：-1 与 0 之和等于目标数 -1 。因此 index1 = 1, index2 = 2 。返回 [1, 2] 。




 提示：


 2 <= numbers.length <= 3 * 10⁴
 -1000 <= numbers[i] <= 1000
 numbers 按 非递减顺序 排列
 -1000 <= target <= 1000
 仅存在一个有效答案

 👍 798 👎 0


解题思路：
1。一种是使用二分查找，复杂度是nlogn
2。 双指针，从两边逼近，sum并和target比较，大了就右边--，小了就左边++
3。 我想到了先找中间位置，向两边走，其实是一样的，但是多了一次循环。
4。要注意边界情况，在查找中间值的时候要考虑到两个都一样，target=0的等情况

*/

//leetcode submit region begin(Prohibit modification and deletion)
func twoSum1(numbers []int, target int) []int {
	mid := 0
	for mid = 0; mid < len(numbers); mid++ {
		if float64(numbers[mid]) == float64(target)/2 && float64(numbers[mid+1]) == float64(target)/2 {
			return []int{mid + 1, mid + 2}
		}
		if float64(numbers[mid]) > float64(target)/2 {
			mid -= 1
			break
		}
	}
	first, second := mid, mid+1
	for first > 0 {
		if numbers[first]+numbers[second] == target {
			break
		}
		if numbers[first]+numbers[second] < target {
			second += 1
		} else {
			first -= 1
		}
	}
	return []int{first + 1, second + 1}
}

//leetcode submit region end(Prohibit modification and deletion)

func RuntowNums1() {
	fmt.Println(twoSum1([]int{12, 83, 104, 129, 140, 184, 199, 300, 306, 312, 321, 325, 341, 344, 349, 356, 370, 405, 423, 444, 446, 465, 471, 491, 500, 506, 508, 530, 539, 543, 569, 591, 606, 607, 612, 614, 623, 627, 645, 662, 670, 685, 689, 726, 731, 737, 744, 747, 764, 773, 778, 787, 802, 805, 811, 819, 829, 841, 879, 905, 918, 918, 929, 955, 997}, 789))
}
